export const fundebugApiKey = '294a8593da2207207c592dcd7364e84e913b366ca32bd592002dfc068c568f58';
export const BaiduStatKey = '50f7f3f779102291f22b776ad51e5893';

export const recordText = [
  '甜有100种方式；吃糖，蛋糕；还有每天98次想你',
  '你知道；我想吃什么吗？我想痴痴地望着你',
  '我知道你在哪里散步；你在我心里散步',
  '最近有谣言说我喜欢你；我要澄清一下；这不是谣言',
  '小哥哥能笑一个吗？我的咖啡今天忘了放糖',
  '你有打火机吗？为何总点燃我的心',
  '知道我想喝什么吗？我想呵护你',
  '知道我为什么感冒吗？因为对你没有抵抗力',
  '被你赞过的朋友圈；叫甜甜圈',
  '你今天怪怪的…；怪好看的',
  '知道你是什么血型吗？你是我的理想型',
  '为什么要害我呢？害我喜欢你',
  '我觉得；你长得像我一个亲戚；像我妈的女婿',
  '我有罪！；我正在你的芳心纵火',
  '我的心；既不在左边也不在右边；只在你那边',
  '你累不累啊？都在我脑子里跑一天了',
];
