import sample from 'lodash/sample';

export const fundebugApiKey = '232ebadc1d4a414336b71465353780738cb2710ef7b60f331757cae6c655c963';
export const BaiduStatKey = '9dcbf85cdc3b9ad0f7e7164efde49115';

export const recordText = [
  '甜有100种方式；吃糖，蛋糕；还有每天98次想你',
  '你知道；我想吃什么吗？我想痴痴地望着你',
  '我知道你在哪里散步；你在我心里散步',
  '最近有谣言说我喜欢你；我要澄清一下；这不是谣言',
  '小哥哥能笑一个吗？我的咖啡今天忘了放糖',
  '你有打火机吗？为何总点燃我的心',
  '知道我想喝什么吗？我想呵护你',
  '知道我为什么感冒吗？因为对你没有抵抗力',
  '被你赞过的朋友圈；叫甜甜圈',
  '你今天怪怪的…；怪好看的',
  '知道你是什么血型吗？你是我的理想型',
  '为什么要害我呢？害我喜欢你',
  '我觉得；你长得像我一个亲戚；像我妈的女婿',
  '我有罪！；我正在你的芳心纵火',
  '我的心；既不在左边也不在右边；只在你那边',
  '你累不累啊？都在我脑子里跑一天了',
];

// 音色
export const voiceToneMap = ['软萌正太音', '傲娇少年音', '清新校草音', '初恋小生音', '慵懒骚年音', '盐系青年音', '喵系青叔音', '醇厚蜀黍音', '深情暖男音', '霸气总裁音', '软甜萝莉音', '幽泉少萝音', '清晨少女音', '傲娇少御音', '精灵森女音', '悠然仙姬音', '酷帅御姐音', '诱惑女神音', '倾城女王音', '霸气女帝音'];

// 声音气质
export const voiceTpmMap = {
  1: [
    '你的嘴角似乎永远泛着笑意<br/>善意是你手边的玫瑰，你从不吝啬付出',
    '音色干净的你，眼神清澈会说话<br/>都怪你，声音太好听，萌化少女心',
    '音色干净的你，眼神清澈会说话<br/>都怪声音太好听，萌化少女心',
    '听你说话，像掉进了蜜罐里<br/>每寸空气都是甜甜哒',
    '皮一下很开心？你可以皮两下<br/>都怪声音太好听，萌化少女心',
  ],
  2: [
    '你注定是改变游戏规则的人<br/>音色清朗的你，是人海中最耀眼的星辰',
    '你桀骜不驯，天生反骨<br/>声音这么迷人的你，是想象中最耀眼的少年',
    '刘昊然的脸，雷佳音的皮<br/>声音这么迷人的你，是想象中最完美的少年',
    '刘昊然的脸，雷佳音的皮<br/>音色清朗的你，是人海中最耀眼的星辰',
    '音色清朗的你，桀骜不驯，天生反骨<br/>你注定是改变游戏规则的人',
  ],
  3: [
    '篮球上的雨滴，操场的青草香<br/>多少人眷恋青春就有多少人迷醉你的声音',
    '你要求颇高，凡事都有你的美学标准<br/>你的声音就是上天最完美的杰作',
    '别出声，你这个芳心纵火犯<br/>你的声音就是上天最完美的杰作',
    '你对自己要求颇高，凡事都有你的美学标准<br/>你的声音就是上天最完美的杰作',
    '别出声，你这个芳心纵火犯<br/>被你声音迷倒的学妹，可绕地球一圈了吧',
    '别出声，你这个芳心纵火犯<br/>有多少人眷恋青春，就有多少人迷醉你的声音',
  ],
  4: [
    '无需恃帅行凶，你仅靠声音就能偷心<br/>你一开口，全世界单身狗仿佛都脱单',
    '无需恃帅行凶，你仅靠声音就能偷心<br/>比初恋脸更可怕的是什么？就是你的初恋音！',
    '比初恋脸更可怕的，是你的初恋音<br/>你一开口，全世界单身狗仿佛都脱单',
    '比初恋脸更可怕的，是你的初恋音<br/>你的声音，仿佛能让人梦想成真',
    '你一开口，全世界单身狗仿佛都脱单<br/>你的声音，仿佛能让人梦想成真',
  ],
  5: [
    '你的声音慵懒又磁性<br/>你喜欢乔装冷漠，却每每为珍视之人奋不顾身',
    '你的声音慵懒又磁性<br/>你知道不被你的声音迷倒，需要多努力吗？',
    '报告！又有人因为你的声音失眠了<br/>你知道不被你的声音迷倒，需要多努力吗？',
    '你的声音慵懒又磁性<br/>无需恃帅行凶，你仅靠声音就能偷心',
    '无需恃帅行凶，你仅靠声音就能偷心<br/>你知道不被你的声音迷倒，需要多努力吗？',
  ],
  6: [
    '听你的声音，就像听到舒服的海浪声<br/>清爽、利落，有一种淡淡的书卷气',
    '听你的声音，就像听到舒服的海浪声<br/>明明可以靠颜值，偏偏声音更好听',
    '听你的声音，就像听到舒服的海浪声<br/>你看似清淡友善，实则腹黑又聪明',
    '你的声音清爽利落，有一种淡淡的书卷气<br/>你看似清淡友善，实则腹黑又聪明',
    '明明可以靠颜值，偏偏声音更好听<br/>从你身上找个缺点，比不看世界杯还难！',
  ],
  7: [
    '你的声音让人无限遐想<br/>你自成一派，只有熟悉的人才能看到你的心软',
    '你的声音让人无限遐想<br/>别出声，你这个芳心纵火犯',
    '你知道不被你的声音迷倒，需要多努力吗？<br/>你一开口，夜晚的繁星也会黯然失色',
    '承认吧！你这位“隐形富豪”<br/>你不知道你的声音就能迷惑众生吗？',
    '承认吧！你这位“隐形富豪”<br/>你知道不被你的声音迷倒，需要多努力吗？',
  ],
  8: [
    '任何不安，都在你的声音里安然靠岸<br/>你的声音就像千帆过尽后，再次相逢的老友',
    '早点听到你的声音，应该可以少走很多弯路<br/>听不进的大道理，你说才有用',
    '你的声音难掩沧桑，却风轻云淡<br/>像千帆过尽后，再次相逢的老友',
    '任何不安的心绪，都能在你的声音里安然靠岸<br/>听不进的大道理，你说就有用',
    '任何不安的心绪，都能在你的声音里安然靠岸<br/>你的声音难掩沧桑，却风轻云淡',
  ],
  9: [
    '你的声音，优雅、深情，直击人心<br/>你总能引起迷妹们扑通扑通的心跳声',
    '无需恃帅行凶，你仅靠声音就能偷心<br/>你的声音总能引起迷妹们扑通扑通的心跳声',
    '你的声音，优雅、深情，直击人心<br/>无需恃帅行凶，你仅靠声音就能偷心',
    '音色这么温暖的你，真是可遇不可求呢<br/>被你声音迷倒的人，可绕地球一圈了吧',
    '听过你声音的人，要求都变高了<br/>这么棒的音色，真是可遇不可求呢',
  ],
  10: [
    '你的声音，总有一种不容置疑的威严感<br/>没有人能逃脱你凌厉的眼神和致命的魅力',
    '间歇性苏断腿，持续性耳朵怀孕<br/>没有人能逃脱你凌厉的眼神和致命的魅力',
    '间歇性苏断腿，持续性耳朵怀孕<br/>你的声音就是最大的“杀伤”武器',
    '你的声音，总有一种不容置疑的威严感<br/>你的声音又苏又霸道，简直听不过瘾',
    '间歇性苏断腿，持续性耳朵怀孕<br/>你的声音又苏又霸道，简直听不过瘾',
  ],
  11: [
    '夏夜星光也比不上你的音质动人<br/>愿这个世界配得上你的纯真',
    '你的音质如软甜果糖，永远鲜活明亮<br/>愿这个世界配得上你的纯真',
    '听你的声音就想自动躺平<br/>任你的小拳拳捶碎胸口',
    '跪求出本卖萌指南吧<br/>清澈灵动的你，如软甜果糖，永远鲜活明亮',
    '夏夜星光也比不上你的音质动人<br/>你的声音能让任何话语自带沁人心脾的香甜',
  ],
  12: [
    '音色独特的你，如世外仙姝<br/>柔弱、神秘，是旁人眼中可望不可及的存在',
    '音色柔弱的你，如世外仙姝<br/>不知不觉融化着别人内心的坚冰',
    '过分了！用声音就能C位出道<br/>传说中的斩男音就是你',
    '音色独特的你，如世外仙姝<br/>传说中的斩男音就是你',
    '过分了！用声音就能C位出道<br/>偶尔给别人留条活路啦',
  ],
  13: [
    '音色清爽的你，是四月初晴的云烟<br/>听你说话，就像听见花开的声音',
    '听你说话，就像听见花开的声音<br/>骨灰级修音师都得含泪退休',
    '声音不好听的苦恼，你根本想象不到<br/>在你面前，骨灰级修音师都得含泪退休',
    '音色清爽的你，是四月初晴的云烟<br/>你偶尔活泼过头，却总能让人重新爱上生活',
    '声音不好听的苦恼，你根本想象不到<br/>音色清爽的你，是四月初晴的云烟',
  ],
  14: [
    '音色迷离的你，个性若即若离<br/>你拥有秋夜般的静美，也有烟火般的绚烂',
    '你的声音是最有效的灵药<br/>老鹿蹒跚的老少年，都会为你小鹿乱撞',
    '老鹿蹒跚的老少年，都会为你小鹿乱撞<br/>恭喜你喜提九亿迷弟心',
    '无论什么状态下的你，声音永远让人过耳难忘<br/>恭喜你喜提九亿迷弟心',
    '你的音色拥有秋夜般静美，也有烟火般绚烂<br/>老鹿蹒跚的老少年，都为你小鹿乱撞',
  ],
  15: [
    '你个性恬淡，却洞察一切<br/>你拥有被月光吻过的声音',
    '你拥有被月光吻过的声音<br/>和你交谈，便是最美好的时光',
    '人的声音可以美到什么程度？<br/>所有敏锐的耳朵都任由你套路',
    '你拥有被月光吻过的声音<br/>所有敏锐的耳朵都任由你套路',
    '人的声音可以美到什么程度？<br/>和你交谈，便是最美好的时光',
  ],
  16: [
    '你的声音自带故事感<br/>如午后红茶，拥有让人沉静的力量',
    '你的声音自带故事感<br/>想听你的声音，与你聊到天荒地老',
    '想把所有键盘都烧光<br/>只听你的声音，与你聊到天荒地老',
    '你的声音自带引力，如钻石耀眼的光<br/>将所有人的注意力都吸引到你的身上',
    '你的声音会开枪<br/>弹头直击旁人的心脏',
  ],
  17: [
    '你像密林里走来的精灵，拥有神秘的治愈力<br/>没有什么比你的声音更抚慰人心',
    '你的声音，可以洗净一切纤尘<br/>你像密林里走来的精灵，拥有神秘的治愈力',
    '你的声音，可以洗净一切纤尘<br/>最理想的生活，是陪你面朝大海春暖花开',
    '你像密林里走来的精灵，美不自知<br/>你的声音，可以洗净一切纤尘',
  ],
  18: [
    '你时而清纯，时而魅惑<br/>你是夏夜撩动人心的小夜曲',
    '你是夏夜撩动人心的小夜曲<br/>每一颗星星都为你发狂',
    '吃鸡的宅男为你出门，社恐为你去蹦迪<br/>声音好听的你，果然能为所欲为啊',
    '你是夏夜撩动人心的小夜曲<br/>吃鸡的宅男为你出门，社恐为你去蹦迪',
    '你能将佛系变狼系，星星都为你发狂<br/>声音好听的你，果然能为所欲为啊',
  ],
  19: [
    '你的声音自带强大气场<br/>音色出众的你，总有骑士默默倾听你',
    '你的声音自带强大气场<br/>目标坚定的你，是多少人念念不忘的梦想',
    '进能化解杠精，退能迷倒戏精<br/>不必眼神确认，你的声音就是最强buff',
    '你的声音自带强大气场<br/>进能化解杠精，退能迷倒戏精',
    '美貌确实是你最不值一提的事<br/>不必眼神确认，你的声音就是最强大的气场',
  ],
  20: [
    '你至情至性，不喜规则束缚<br/>你的声音一如你的人格，拥有不容抗拒的魔力',
    '优秀如你，已无需任何人证明<br/>你最爱逆风翻盘，声音拥有不容抗拒的魔力',
    '你的声音气场两米八<br/>一个人就是一支女团',
    '不折腾不爽，你最爱逆风翻盘<br/>你一开口，气场就是两米八',
    '你的声音拥有不容抗拒的魔力<br/>你用声音统治着专属于你的帝国',
  ],
};

export const loadingTips = [
  sample([['报告！', '分析音色中'], ['接收完毕！', '正在检测~'], ['好鸡冻！', '分析音色中']]),
  sample([
    ['哇！', '音色好特别'],
    ['你的声音', '过耳难忘~'],
    ['我快被你的', '声音迷倒了'],
    ['你的声音', '超有辨识度'],
  ]),
  sample([['嘻嘻！在做', '最后匹配'], ['你的声音', '像某个明星'], ['分析结果', '出来了哦！']]),
];

export const downloadUrlMap = {
  f301: 'http://a.app.qq.com/o/simple.jsp?pkgname=com.yibasan.lizhifm&ckey=CK1382027903340',
  f302: 'http://a.app.qq.com/o/simple.jsp?pkgname=com.yibasan.lizhifm&ckey=CK1382027903341',
  f303: 'http://a.app.qq.com/o/simple.jsp?pkgname=com.yibasan.lizhifm&ckey=CK1382027903342',
  f304: 'http://a.app.qq.com/o/simple.jsp?pkgname=com.yibasan.lizhifm&ckey=CK1382027903343',
  f305: 'http://a.app.qq.com/o/simple.jsp?pkgname=com.yibasan.lizhifm&ckey=CK1382035271386',
  f306: 'http://a.app.qq.com/o/simple.jsp?pkgname=com.yibasan.lizhifm&ckey=CK1382035436691',
  f307: 'http://a.app.qq.com/o/simple.jsp?pkgname=com.yibasan.lizhifm&ckey=CK1382118909442',
  f308: 'http://a.app.qq.com/o/simple.jsp?pkgname=com.yibasan.lizhifm&ckey=CK1382038513661',
  f309: 'http://a.app.qq.com/o/simple.jsp?pkgname=com.yibasan.lizhifm&ckey=CK1382037047286',
  f310: 'http://a.app.qq.com/o/simple.jsp?pkgname=com.yibasan.lizhifm&ckey=CK1382037515188',
  f311: 'http://a.app.qq.com/o/simple.jsp?pkgname=com.yibasan.lizhifm&ckey=CK1382037712186',
  f312: 'http://a.app.qq.com/o/simple.jsp?pkgname=com.yibasan.lizhifm&ckey=CK1382037712188',
  f313: 'http://a.app.qq.com/o/simple.jsp?pkgname=com.yibasan.lizhifm&ckey=CK1382038860739',
  f314: 'http://a.app.qq.com/o/simple.jsp?pkgname=com.yibasan.lizhifm&ckey=CK1382038896614',
  f315: 'http://a.app.qq.com/o/simple.jsp?pkgname=com.yibasan.lizhifm&ckey=CK1382038896615',
  f316: 'http://a.app.qq.com/o/simple.jsp?pkgname=com.yibasan.lizhifm&ckey=CK1382039207816',
  f317: 'http://a.app.qq.com/o/simple.jsp?pkgname=com.yibasan.lizhifm&ckey=CK1382040757744',
  f318: 'http://a.app.qq.com/o/simple.jsp?pkgname=com.yibasan.lizhifm&ckey=CK1382040966744',
  f319: 'http://a.app.qq.com/o/simple.jsp?pkgname=com.yibasan.lizhifm&ckey=CK1382041013778',
  f320: 'http://a.app.qq.com/o/simple.jsp?pkgname=com.yibasan.lizhifm&ckey=CK1382041149502',
};